Germanvelardez2018/SIMO-STM32-framework/Core/simo/wdt.c
#include "wdt.h"
#include "stm32f1xx_hal_iwdg.h"

// Contador de 12 bits


static IWDG_HandleTypeDef __hiwdg;



static void  __set_parameter(WDT_PRE pre, uint32_t reload){

    switch (pre)
    {
    case WDT_PRE_4:
        __hiwdg.Init.Prescaler = IWDG_PRESCALER_4 ;
        break;

    case WDT_PRE_8:
        __hiwdg.Init.Prescaler = IWDG_PRESCALER_8 ;
        break;

    case WDT_PRE_16:
        __hiwdg.Init.Prescaler = IWDG_PRESCALER_16 ;
        break;

    case WDT_PRE_32:
        __hiwdg.Init.Prescaler = IWDG_PRESCALER_32 ;
        break;

    case WDT_PRE_64:
        __hiwdg.Init.Prescaler = IWDG_PRESCALER_64 ;
        break;

    case WDT_PRE_128:
        __hiwdg.Init.Prescaler = IWDG_PRESCALER_128 ;
        break;

    case WDT_PRE_256:
        __hiwdg.Init.Prescaler = IWDG_PRESCALER_256 ;
        break;
    
    default:
        __hiwdg.Init.Prescaler = IWDG_PRESCALER_256 ;

        break;
    }
    __hiwdg.Init.Reload = reload;

}



simo_state  simo_wdt_init(uint32_t reload_value, WDT_PRE prescaler ){
    simo_state ret = SIMO_ERROR;
    __hiwdg.Instance = IWDG;
    __set_parameter(prescaler,reload_value);
      if (HAL_IWDG_Init(&__hiwdg) == HAL_OK)
  {
     ret = SIMO_OK;
  }
  return ret;
}



 void simo_wdt_refresh(void){
    HAL_IWDG_Refresh(&__hiwdg);
}

